backend: tensorflow
class_name: Model
config:
  input_layers:
  - [input1, 0, 0]
  layers:
  - class_name: InputLayer
    config:
      batch_input_shape: &id001 !!python/tuple [null, 1000]
      dtype: float32
      name: input1
      sparse: false
    inbound_nodes: []
    name: input1
  - class_name: Model
    config:
      input_layers:
      - [input1, 0, 0]
      layers:
      - class_name: InputLayer
        config:
          batch_input_shape: *id001
          dtype: float32
          name: input1
          sparse: false
        inbound_nodes: []
        name: input1
      - class_name: Embedding
        config:
          activity_regularizer: null
          batch_input_shape: !!python/tuple [null, null]
          dtype: float32
          embeddings_constraint: null
          embeddings_initializer:
            class_name: RandomUniform
            config: {maxval: 0.05, minval: -0.05, seed: null}
          embeddings_regularizer: null
          input_dim: 20000
          input_length: null
          mask_zero: false
          name: embedding_1
          output_dim: 300
          trainable: true
        inbound_nodes:
        - - - input1
            - 0
            - 0
            - {}
        name: embedding_1
      - class_name: Embedding
        config:
          activity_regularizer: null
          batch_input_shape: !!python/tuple [null, null]
          dtype: float32
          embeddings_constraint: null
          embeddings_initializer:
            class_name: RandomUniform
            config: {maxval: 0.05, minval: -0.05, seed: null}
          embeddings_regularizer: null
          input_dim: 20000
          input_length: null
          mask_zero: false
          name: embedding_2
          output_dim: 300
          trainable: true
        inbound_nodes:
        - - - input1
            - 0
            - 0
            - {}
        name: embedding_2
      - class_name: Conv1D
        config:
          activation: linear
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {}
          bias_regularizer: null
          dilation_rate: !!python/tuple [1]
          filters: 10
          kernel_constraint: null
          kernel_initializer:
            class_name: VarianceScaling
            config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
          kernel_regularizer: null
          kernel_size: !!python/tuple [1]
          name: conv1d_1
          padding: valid
          strides: !!python/tuple [1]
          trainable: true
          use_bias: true
        inbound_nodes:
        - - - embedding_1
            - 0
            - 0
            - {}
        name: conv1d_1
      - class_name: Conv1D
        config:
          activation: linear
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {}
          bias_regularizer: null
          dilation_rate: !!python/tuple [1]
          filters: 10
          kernel_constraint: null
          kernel_initializer:
            class_name: VarianceScaling
            config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
          kernel_regularizer: null
          kernel_size: !!python/tuple [4]
          name: conv1d_2
          padding: valid
          strides: !!python/tuple [1]
          trainable: true
          use_bias: true
        inbound_nodes:
        - - - embedding_2
            - 0
            - 0
            - {}
        name: conv1d_2
      - class_name: Activation
        config: {activation: relu, name: activation_1, trainable: true}
        inbound_nodes:
        - - - conv1d_1
            - 0
            - 0
            - {}
        name: activation_1
      - class_name: Activation
        config: {activation: relu, name: activation_2, trainable: true}
        inbound_nodes:
        - - - conv1d_2
            - 0
            - 0
            - {}
        name: activation_2
      - class_name: AveragePooling1D
        config:
          name: average_pooling1d_1
          padding: valid
          pool_size: !!python/tuple [2]
          strides: !!python/tuple [2]
          trainable: true
        inbound_nodes:
        - - - activation_1
            - 0
            - 0
            - {}
        name: average_pooling1d_1
      - class_name: AveragePooling1D
        config:
          name: average_pooling1d_2
          padding: valid
          pool_size: !!python/tuple [2]
          strides: !!python/tuple [2]
          trainable: true
        inbound_nodes:
        - - - activation_2
            - 0
            - 0
            - {}
        name: average_pooling1d_2
      - class_name: Dropout
        config: {name: dropout_1, noise_shape: null, rate: 0.5, seed: null, trainable: true}
        inbound_nodes:
        - - - average_pooling1d_1
            - 0
            - 0
            - {}
        name: dropout_1
      - class_name: Dropout
        config: {name: dropout_2, noise_shape: null, rate: 0.5, seed: null, trainable: true}
        inbound_nodes:
        - - - average_pooling1d_2
            - 0
            - 0
            - {}
        name: dropout_2
      - class_name: GlobalAveragePooling1D
        config: {name: global_average_pooling1d_1, trainable: true}
        inbound_nodes:
        - - - dropout_1
            - 0
            - 0
            - {}
        name: global_average_pooling1d_1
      - class_name: GlobalAveragePooling1D
        config: {name: global_average_pooling1d_2, trainable: true}
        inbound_nodes:
        - - - dropout_2
            - 0
            - 0
            - {}
        name: global_average_pooling1d_2
      - class_name: Concatenate
        config: {axis: -1, name: concatenate_1, trainable: true}
        inbound_nodes:
        - - - global_average_pooling1d_1
            - 0
            - 0
            - &id002 {}
          - - global_average_pooling1d_2
            - 0
            - 0
            - *id002
        name: concatenate_1
      name: model_1
      output_layers:
      - [concatenate_1, 0, 0]
    inbound_nodes:
    - - - input1
        - 0
        - 0
        - {}
    name: model_1
  - class_name: Dropout
    config: {name: dropout_3, noise_shape: null, rate: 0.3, seed: null, trainable: true}
    inbound_nodes:
    - - - model_1
        - 1
        - 0
        - {}
    name: dropout_3
  - class_name: Dense
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      name: dense_1
      trainable: true
      units: 30
      use_bias: true
    inbound_nodes:
    - - - dropout_3
        - 0
        - 0
        - {}
    name: dense_1
  - class_name: Activation
    config: {activation: relu, name: activation_3, trainable: true}
    inbound_nodes:
    - - - dense_1
        - 0
        - 0
        - {}
    name: activation_3
  - class_name: Dense
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      name: dense_2
      trainable: true
      units: 2
      use_bias: true
    inbound_nodes:
    - - - activation_3
        - 0
        - 0
        - {}
    name: dense_2
  - class_name: Activation
    config: {activation: softmax, name: main_output_1, trainable: true}
    inbound_nodes:
    - - - dense_2
        - 0
        - 0
        - {}
    name: main_output_1
  name: model_3
  output_layers:
  - [main_output_1, 0, 0]
keras_version: 2.0.9
